tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "microsoft/git"
tap "koekeishiya/formulae"

# Terminal Tool
brew "duckdb"
brew "jq"
brew "openssl@3", link: false
brew "fastfetch"
brew "wget"
brew "ripgrep"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "jordanbaird-ice"
brew "lazygit"
brew "bat"
brew "asdf"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "tmux"
brew "tmuxinator"
brew "fzf"
brew "gh" 
brew "zoxide"
brew "eza"
brew "battery"


# Cask
cask "karabiner-elements"
cask "hammerspoon"
cask "ubersicht"
cask "raycast"
cask "spotify"
cask "arc"
cask "monitorcontrol"
cask "cloudflare-warp"
cask "evkey"
