tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "microsoft/git"
# Run your GitHub Actions locally
brew "act"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# GitHub command-line tool
brew "gh"
# Lightweight and flexible command-line JSON processor
brew "jq"
# General-purpose data compression with high compression ratio
brew "xz"
# Development kit for the Java programming language
brew "openjdk"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3", link: false
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Object-relational database system
brew "postgresql@14"
# Tool Command Language
brew "tcl-tk", link: false
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Terraform
brew "hashicorp/tap/terraform"
cask "git-credential-manager-core"
vscode "4ops.terraform"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.project-manager"
vscode "bastienboutonnet.vscode-dbt"
vscode "bierner.markdown-preview-github-styles"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "holistics.holistics-aml-vscode-ext"
vscode "innoverio.vscode-dbt-power-user"
vscode "janisdd.vscode-edit-csv"
vscode "johnpapa.vscode-peacock"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "njpwerner.autodocstring"
vscode "pomdtr.excalidraw-editor"
vscode "RandomFractalsInc.vscode-data-preview"
vscode "ritwickdey.LiveServer"
vscode "samuelcolvin.jinjahtml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "TabNine.tabnine-vscode"
vscode "tomoki1207.pdf"
vscode "TTOOWA.in-your-face-incredible"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wesbos.theme-cobalt2"
vscode "yzhang.markdown-all-in-one"
