tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "microsoft/git"
tap "koekeishiya/formulae"

# Terminal Tool
brew "direnv"
brew "docker"
brew "duckdb"
brew "gh"
brew "jq"
brew "openssl@3", link: false
brew "fastfetch"
brew "wget"
brew "tmux"
brew "ripgrep"
brew "fzf"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "jordanbaird-ice"


# Cask
cask "karabiner-elements"
cask "cursor"
cask "hammerspoon"
cask "ubersicht"
cask "git-credential-manager-core"
cask "1password"
cask "raycast"
cask "slack"
cask "spotify"
cask "arc"
cask "google-chrome"
cask "monitorcontrol"
cask "cloudflare-warp"
cask "evkey"
